# Overview

## Instructions

__Due Date: Sunday, 2023-MAR-12 at 11:59pm__


__You may not use late days.__


You have one week to complete the take home portion of the midterm. All of the work must be your own, you may not work in groups or teams. You may use outside sources so long as you cite them and provide links. 

Points will be taken off for any answers that are extremely verbose. Try to stay between 2-3 sentences for definitions and 5 sentences for longer questions. 

You may post __privately__ on Ed or attend OH for clairification questions. TAs will not be providing hints.

There is a [post on Ed](https://edstem.org/us/courses/32981/discussion/2716284) that:
- Provides submission instructions.
- Clarifications and corrections on questions.
    
__Students are responsible for reading and monitoring the post.__

## Environment Setup

- __Note:__ You will need to change the MySQL userID and password in some of the cells below to match your configuration.

### Environments

- Different applications and different scenarios use different ways to interaction with databases.


- We use three different connection/interaction models to give students experience with the various options.

### ipython-SQL

In [1]:
%load_ext sql

In [2]:
#
# Set the userid and password for connecting to your instance of SQL.
#
mysql_user = "root"
mysql_password = "20010308"

mysql_url = f"mysql+pymysql://{mysql_user}:{mysql_password}@localhost"

print("Your connection URL is", mysql_url)

Your connection URL is mysql+pymysql://root:20010308@localhost

In [3]:
#
# Connect. See the ipython-sql documentation for the $variable syntax.
#
%sql $mysql_url

'Connected: root@None'

### SQL Alchemy and Pandas

In [4]:
#
# Yes, I know the cool kids import as pd. I am not cool.
#
import pandas

In [5]:
#
# Pandas SQL operations require a SQL Alchemy engine.
#
from sqlalchemy import create_engine

In [6]:
sql_engine = create_engine(mysql_url)

### pymysql

In [7]:
import pymysql

In [8]:
pymysql_con = pymysql.connect(
    user=mysql_user,
    password=mysql_password,
    host="localhost",
    port=3306,
    autocommit=True,
    cursorclass=pymysql.cursors.DictCursor)

## Data Loading

### Classic Models

- We will use the [Classic Models](https://www.mysqltutorial.org/mysql-sample-database.aspx) sample database for many of the questions on this exam.


- The directory containing this notebook contains a file ```classic-models-sample.sql```.


- Load the data:
    - Open the file in DataGrip using ```File -> Open``` dialog.
    - Select all of the text/SQL in the file.
    - Click the green arrowhead to run the files contents.
    
    
- Running the following queries will test if the load worked.

In [9]:
%sql use classicmodels;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [10]:
%sql show tables;

 * mysql+pymysql://root:***@localhost
8 rows affected.

[('customers',),
 ('employees',),
 ('offices',),
 ('orderdetails',),
 ('orders',),
 ('payments',),
 ('productlines',),
 ('products',)]

In [11]:
%sql select count( * ) as count from orders join orderdetails using(orderNumber)

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(2996,)]

### Lahman's Baseball Database

- You previously loaded information from [Lahman's Baseball Database.](https://www.seanlahman.com/)


- If you have not done so, the following code will load the data into a new schema ```lahmansdb_midterm```.

In [12]:
%sql create schema lahmansdb_midterm

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [13]:
people_df = pandas.read_csv("./People.csv")
people_df.to_sql("people", schema="lahmansdb_midterm", con=sql_engine, index=False, if_exists="replace")

20370

In [14]:
batting_df = pandas.read_csv("./Batting.csv")
batting_df.to_sql("batting", schema="lahmansdb_midterm", con=sql_engine, index=False, if_exists="replace")

110495

In [15]:
pitching_df = pandas.read_csv("./Pitching.csv")
pitching_df.to_sql("pitching", schema="lahmansdb_midterm", con=sql_engine, index=False, if_exists="replace")

49430

- This will test the data loading.

In [16]:
%sql select count( * ) as people_count from lahmansdb_midterm.people;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(20370,)]

In [17]:
%sql select count( * ) as batting_count from lahmansdb_midterm.batting;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(110495,)]

In [18]:
%sql select count( * ) as pitching_count from lahmansdb_midterm.pitching;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(49430,)]

# Written Questions

## W1

_Question_


- Define the concept of _immutable_ column and key.


- Why do some sources recommend that a primary key should be immutable?


- How would to implement immutability for a primary key in a table?

<u>Answer</u>


- Immutable columns are columns that can't be changed after being inserted. Key is a column or a set of columns that uniquely identifies a row, key can either be primary key or foreign key.
- Some operations rely on the uniqueness and consistency of the primary key, especially when it is refered in another table. If the primary key can be muted, changing its value may break some constraints and cause errors. Also, being immutable allows the database to adopt some optimizations like index to improve performance.
- Set the key to be `NOT NULL AUTO_INCREMENT` to provide a default value, and set a trigger `ON UPDATE` to prevent updating this key.

## W2

_Question_

Views are a powerful concept in relational database management systems. List and briefly explain 3 benefits of/reasons for creating a view.

_Answer_

- View can improve data security by hiding some sensitive columns or filter some rows from user, without blocking the user from the entire table. View can also provide aggregated data to user without revealing raw data, which might contains some private information.
- View can create an abstraction layer over the underlying schema, and can simplify data queries. When performing a simple query on a view, it can be automatically converted to a complex query involving multiple tables, saving user's time and effort.
- Materialized view can increase performance by caching some common query data, so when the data is actually queried, instead of calculating table joins, DBS can simply return the cached data, decreasing response delay.

## W3

_Question_

Briefly explain the concepts of _procedural_ language and _declarative_ language. SQL is primarily a declarative language. SQL added procedure language capabilities in functions, procedures and triggers. What is a reason for this addition?

_Answer_

In _procedual language_, user have to describe the exact steps of instruction to query the data, while in _declaritive language_, user only need to describe the desired output, and the instructions will be generated and executed automatically.

SQL add procedure language capabilities because it needs to perform some complex business logic that is hard to express in a declaritive way. Adding the procedure language capabilities allows users to easily convert the business logic into SQL syntax.

## W4

_Question_ 

The following diagram is a simple representation of the architecture of a Jupyter notebook using MySQL. Is this a two-tier architecture or a three-tier architecture? Explain your answer briefly.

<img src="./jupyter-notebook.png">

_Answer_

It's a two-tier architecture. Although it seems that the user access notebook server instead of directly accessing MySQL, the notebook and server does not contain any business logic, and the user may type SQL directly to query data. Therefore, this browser-server-kernel stack should be viewed as a client application as a whole and this architecture conforms to two-tier architecture paradigm.

## W5

_Question_ 

- Consider a US Social Security Number. An example is "012-34-6789".


- The data _type_ is character string.


- The relational model requires that columns (attributes) are from a _domain._


- Use the Social Security Number example to explain the difference between a type and a domain.

<br><br>

_Answer_

Type is a datatype built in DBS to support the storage of a certain type of data, for example, `INT, TEXT, DATETIME`. The social security number uses character string _type_ to store the data.

Domain is a user-defined concept that restrict the actural value allowed to pick. In this example, although the _type_ of social security number is string, the number must conform to certain syntax to be valid, this is the requirement of its _domain_.

## W6

_Question_

Briefly explain the differences between:

- Database stored procedure
- Database function
- Database trigger

_Answer_

- Stored procedure and trigger are meant to perform complex database operations. They are allowed to update data (`INSERT, UPDATE, DELETE`) while function can only execute `SELECT`.
- Function is meant to calculate a value (or a table). It must return a value (while others do not), and can be embedded in a `SELECT` statement.
- Trigger can be executed automatically when a preset event occurs, while procedure and function can only be called manually (or through external program).

## W7

_Question_


Briefly explain:

- Natural join
- Equi-join
- Theta join
- Self-join

_Answer_

- Natural join: Two tables are joined on condition that columns with the same name should have matched value.
- Equi-join: Two tables are joined on condition that a common column has matched value.
- Theta join: Two tables are joined on a specified condition.
- Self-join: A tabled is joined to itself.

## W8

_Question_

Briefly explain the difference between a _unique (key) constraint_ and a _primary key constraint?_

_Answer_

- Primary key constraint does not allow null value, while that's not the case in unique key constraint.
- A table can only have on primary key constraint, but can create multiple unique key constraints.

## W9

_Question_

Give two reasons for using an _associative entity_ to implement a relationship instead of using a foreign key.

_Answer_

- Associative entity allows extra information to be inserted into the many-to-many relationship.
- When the two table grow larger, associative entity have better query performance than joining two tables using foreign key.

## W10

_Question_

Briefly explain the concepts of:
- Conceptual model
- Logical model
- Physical model

For data modeling.

_Answer_

- Conceptual model shows the high-level relationships between entities and hides technical detail. It's typically represented with E-R diagram.
- Logical model defines some technical details, including the data type of each column, as well as constraints and relationships.
- Physical model is the implementation of the system, by defining the logical model with DDL on a specific DBMS system. It also needs to deal with implementation details such as indexing, storage, etc.

## W11

_Question_

Briefly explain the concepts of:
- Data manipulation language
- Data definition language

Given an example statement in SQL for DML and for DDL.

_Answer_

DDL is used to create / update the structure of the database. It operates database objects such as tables and views. Example:
```sql
CREATE TABLE department (
    dept_name   CHAR(20),
    building    CHAR(15),
    budget      NUMERIC(12,2)
);
```

DML is used to operate the data inside a database, without modifying its structure. It retrieves and manipulate certain rows in tables. Example:
```sql
SELECT *
FROM instructor
WHERE instructor.dept_name = 'History';
```

## W12

_Question_

Codd's 4th rule is:

<u>Rule 4 - Dynamic online catalog based on the relational model:</u>

The database description is represented at the logical level in the same way as ordinary data, so that authorized users can apply the same relational language to its interrogation as they apply to the regular data.

Explain what this means, and use SQL to provide examples.

_Answer_

This means that the metadata of a database should be stored in the same way as the data inside the database and can be queried using the same language as ordinary data.

Example: say we have a `employees` table, to query its data, we can use SQL:
```sql
SELECT * FROM employees;
```
To get it's metadata, for example, columns, we can use SQL:
```sql
SELECT column_name, data_type
FROM information_schema.columns
WHERE table_name = 'employees';
```

## W13

_Question_

The formal definition of a theta join is

\begin{equation}
r \bowtie_\theta s = \sigma_\theta  (r \times s)
\end{equation}

Briefly explain the definition and give an example. 

Why is the fact that the relational algebra is closed is important to this definition?

_Answer_

The join operation is selecting a subset of the cartesian product of two tables. Theta join is two joined on a specified condition, which is exactly what the notation is saying: first calculate the cartesian product, and select by condition $\theta$.

Example:

Consider two tables: `customer(c_id, c_name, age)`, `order(o_id, o_name)`, the table $c\bowtie_{c.c\_id > o.o\_id}$ should have all customer-order pairs with `c_id > o_id`.

Relational algebra is _closed_ means that the output of an operation is still a relation, thus can be the input of another operation. In this case, $(r \times s)$ is a relation, so can be used as input of $\sigma_\theta$.

## W14

_Question_

Consider two different statements in the relational algebra or SQL.


Despite being different statements, the statements may be <u>equivalent.</u> Briefly explain what this means.

_Answer_

Equivalent queries produce the same result under all possible inputs. For example,
```sql
SELECT *
FROM (SELECT * FROM r) UNION ALL (SELECT * FROM s)
WHERE p

(SELECT * FROM r WHERE p)
UNION ALL
(SELECT * FROM s WHERE p)
```
Equivalent queries may have different performance during execution.

## W15

_Question_

Consider the following relation definitions.

\begin{equation}
Customers(ID, last\_name, first\_name)
\end{equation}


\begin{equation}
Accounts(ID, balance, customer\_ID)
\end{equation}


What is problem with using natural join on the two tables?

_Answer_

Natural join combine two tables on condition that columns with the same name should have matched value. In this case, `customers.ID` is merged with `accounts.ID`, but should have been merged with `accounts.customer_ID`.

# Entity Relationship Modeling

## ER-1

_Question_

This question tests your ability to "bottom up" model or "reverse engineering" a SQL schema to produce an explanatory ER-diagram.


Use Lucidchart to draw a Crow's Foot notation diagram representing the following SQL.


You can use the simple table names, e.g. ```students``` instead of ```s23_w4111_midterm.students```.


```
drop schema if exists s23_midterm;

create schema s23_midterm;

use s23_midterm;

drop table if exists departments;
create table if not exists departments
(
    dept_code varchar(4)   not null
        primary key,
    dept_name varchar(128) not null
);

drop table if exists instructors;
create table if not exists instructors
(
    UNI        varchar(12)  not null
        primary key,
    last_name  varchar(128) not null,
    first_name varchar(128) not null,
    dept_code  varchar(4)   null,
    constraint instructor_dept
        foreign key (dept_code) references departments (dept_code)
);

drop table if exists students;
create table if not exists students
(
    UNI        varchar(12)  not null
        primary key,
    last_name  varchar(128) null,
    first_name varchar(128) null
);

drop table if exists students_advisors;
create table if not exists students_advisors
(
    student_uni         varchar(12) not null,
    instructor_uni      varchar(12) not null,
    advising_start_date date        not null,
    advising_end_date   date        null,
    primary key (student_uni, instructor_uni, advising_start_date),
    constraint student_advisor_instructor
        foreign key (instructor_uni) references instructors (UNI),
    constraint student_advisors_student
        foreign key (student_uni) references students (UNI)
);


```

_Answer_

![](./ER1.png)

## ER-2

_Question_

- This question tests your ability to convert a human language description of a data model into a Crow's Foot ER-Diagram.


- Consider the data model for Classic Models that you loaded.



- ```orders``` has a column ```comments.```

In [19]:
%sql select * from classicmodels.orders limit 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(10100, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363),
 (10101, datetime.date(2003, 1, 9), datetime.date(2003, 1, 18), datetime.date(2003, 1, 11), 'Shipped', 'Check on availability.', 128),
 (10102, datetime.date(2003, 1, 10), datetime.date(2003, 1, 18), datetime.date(2003, 1, 14), 'Shipped', None, 181),
 (10103, datetime.date(2003, 1, 29), datetime.date(2003, 2, 7), datetime.date(2003, 2, 2), 'Shipped', None, 121),
 (10104, datetime.date(2003, 1, 31), datetime.date(2003, 2, 9), datetime.date(2003, 2, 1), 'Shipped', None, 141),
 (10105, datetime.date(2003, 2, 11), datetime.date(2003, 2, 21), datetime.date(2003, 2, 12), 'Shipped', None, 145),
 (10106, datetime.date(2003, 2, 17), datetime.date(2003, 2, 24), datetime.date(2003, 2, 21), 'Shipped', None, 278),
 (10107, datetime.date(2003, 2, 24), datetime.date(2003, 3, 3), datetime.date(2003, 2, 26), 'Shipped', 'Difficult to negotiate with customer. We need more marketing materials', 131),
 (10108, datetime.date(2003, 3, 3), datetime.date(2003, 3, 12), datetime.date(2003, 3, 8), 'Shipped', None, 385),
 (10109, datetime.date(2003, 3, 10), datetime.date(2003, 3, 19), datetime.date(2003, 3, 11), 'Shipped', 'Customer requested that FedEx Ground is used for this shipping', 486)]

- There are several issues with this design:
    - If there are multiple comments or responses to comments, the ```comments``` field becomes multi-valued.
    - The approach does not have information on when the comment was made, who made the comment and whether it is a response or elaboration.
    
    
- You will solve this problem in a simplified version of classic models. In the simplified model, there are three entity types:
    1. ```person``` has the following attributes:
        - ```ID```
        - ```last_name```
        - ```first_name```
    2. ```orders``` has the following attributes:
        - ```order_id```
        - ```order_status```
        - ```order_date```
    3. ```comments``` has the following attributes:
        - ```comment_id``` is a unique ID for all comments.
        - ```parent_comment_id``` is the ```comment_id``` of a comment for which this comment is a response or elaboration.
        - ```comment_timestamp```, when the comment occured.
        - ```commenter_id``` is the ID of the person making the comment.
        - ```order_id``` is the ID of the order for to which this comment applies.
        
        
- Use Lucidchart to draw a _logical model_ for the described datamodel.


- You may add notes to the diagram to document reasonable assumptions or desgn decisions.

_Answer_

![](./ER2.png)

Assumption: Unregistered user cannot post a comment, that is, all comments must correspond to a person who posts it.

# Relational Algebra

- Use the [RelaX Calculator and the Silberschatz calculator](https://dbis-uibk.github.io/relax/calc/gist/4f7866c17624ca9dfa85ed2482078be8/relax-silberschatz-english.txt/0) with the Silberschatz database for these questions.


- Your answers will have two Markdown cells. The first is the relational statement you used to solve the problem. The second is a screen capture of the query execution and first page of result rows. And example is:

```
π course_id, title,
	instructor_id←ID,
	instructor_name←name
(
	(
		(course ⨝ section) 
		⨝ 
		teaches
	) 
	⨝
	instructor
)
```

<img src="./relational-example.png">

## R1

_Question_

- Consider the relation produced by:

```
π course_id, sec_id, building, room_number, time_slot_id (section)
```

- This contains sections, their time assignments and room assignments independent of the year and semester.


- Two sections in this derived table conflict if they have the same ```building, room_number, time_slot_id```.


- My answer to this question is ... ...

|one.course_id|one.sec_id|one.building|one.room_number|one.time_slot_id|two.course_id|two.sec_id|two.building|two.room_number|two.time_slot_id|
|-------------|----------|------------|---------------|----------------|-------------|----------|------------|---------------|----------------|
|CS-347       |1         |Taylor      |3128           |A               |CS-190       |2         |Taylor      |3128           |A               |
|EE-181       |1         |Taylor      |3128           |C               |CS-319       |2         |Taylor      |3128           |C               |

- Your answer cannot include courses and sections that conflict with themselves, or have two rows that show the same conflict.

_Answer_

```
(ρ one (π course_id, sec_id, building, room_number, time_slot_id (section)))
⨝ (one.building = two.building ∧ one.room_number = two.room_number ∧ one.time_slot_id = two.time_slot_id ∧ one.course_id < two.course_id)
(ρ two (π course_id, sec_id, building, room_number, time_slot_id (section)))
```

![](./R1.png)

## R2

_Question_

- You may use the following operators for this question: ```π, σ, ρ, ←```.


- Use the ```instructor, student, advisor``` tables for this question.


- There are some students that do not have advisors. That are some instructors that are not advisors.


- An ```instructor``` can be an advisor for a ```student``` if they are in the same department (```dept_name```).


- Produce a relation of the form

```(instructor_id, instructor_name, instructor_dept_name, student_id, student_name, student_dept_name)```

- That matches instructors that do not advise students and students that do not have advisors and are in the same department.

```
σ instructor_dept_name = student_dept_name
ρ instructor_id ← instructor.ID,
instructor_name ← instructor.name,
instructor_dept_name ← instructor.dept_name,
student_id ← student.ID,
student_name ← student.name,
student_dept_name ← student.dept_name
((π ID, name, dept_name σ i_id = ID ( (ρ i_id←ID π ID (instructor) - π i_id (advisor)) ⨯ instructor ))
⨯
(π ID, name, dept_name σ s_id = ID ( (ρ s_id←ID π ID (student) - π i_id (advisor)) ⨯ student )))
```

![](./R2.png)

# SQL

## S1

_Question_

- You have a logical datamodel ER-diagram (see below).


- You need to use DDL to define a schema that realizes the model.


- Logical models are not specific enough for direct implementation. This means that:
    - You will have to assign concrete types to columns, and choose things like ```GENERATED,``` ```DEFAULT,``` etc.
    - You may have to decompose a table into two tables, or extract common attributes from multiple tables into a single, referenced table.
    - Implementing the relationships may require adding columns and foreign keys, associative entities, etc.
    - You may have to make other design and implementation choices. <b>This means that there is no single correct answer.</b>
    

- You should document any reasonable assumptions you make.


| <img src="./s23-midterm-er-to-sql-v2.png"> |
| :---: |
| __ER Diagram__ |

_Answer_

Design Decisions, Notes, etc:
1. Patient's insurance company is stored in a column of `patient` table, instead of a separate table.
2.

_DDL_

- Execute your DDL in the cell below. You may use DataGrip or other tools to help build the schema.


- You can copy and paste the ```SQL CREATE TABLE``` below, but you MUST execute the statements.

In [20]:
%sql drop schema if exists s23_midterm_medical

%sql create schema s23_midterm_medical

 * mysql+pymysql://root:***@localhost
0 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [21]:
%%sql

USE s23_midterm_medical;

CREATE TABLE physician
(
    physician_id   VARCHAR(128) PRIMARY KEY,
    last_name      VARCHAR(128)            NOT NULL,
    first_name     VARCHAR(128)            NOT NULL,
    physician_type ENUM ('NP', 'MD', 'DO') NOT NULL
);

CREATE TABLE patient
(
    patient_id            VARCHAR(128) PRIMARY KEY,
    last_name             VARCHAR(128) NOT NULL,
    first_name            VARCHAR(128) NOT NULL,
    street                VARCHAR(128) NOT NULL,
    city                  VARCHAR(128) NOT NULL,
    `state`               VARCHAR(128) NOT NULL,
    postal_code           VARCHAR(128) NOT NULL,
    insturance_company_id VARCHAR(128) NOT NULL
);

CREATE TABLE appointment
(
    appt_id       VARCHAR(128) PRIMARY KEY,
    physician_id  VARCHAR(128) NOT NULL,
    patient_id    VARCHAR(128) NOT NULL,
    appt_date     DATE         NOT NULL,
    appt_time     TIME         NOT NULL,
    appt_duration INT          NOT NULL CHECK (appt_duration > 0 AND appt_duration < 120),
    appt_reason   CHAR(3)      NULL,
    FOREIGN KEY (physician_id) REFERENCES physician (physician_id),
    FOREIGN KEY (patient_id) REFERENCES patient (patient_id)
);

CREATE TABLE bill
(
    bill_id            VARCHAR(128) PRIMARY KEY,
    appt_id            VARCHAR(128) UNIQUE                 NOT NULL,
    amount_insured     FLOAT UNSIGNED                      NOT NULL,
    amount_not_insured FLOAT UNSIGNED                      NOT NULL,
    bill_total         FLOAT UNSIGNED                      NOT NULL,
    bill_date          DATE                                NOT NULL,
    bill_status        ENUM ('PAID', 'UNPAID', 'DISPUTED') NOT NULL,
    FOREIGN KEY (appt_id) REFERENCES appointment (appt_id),
    CONSTRAINT check_bill_total CHECK ( amount_insured + amount_not_insured = bill_total )
);

CREATE TABLE payment
(
    reciept_id  VARCHAR(128) PRIMARY KEY,
    bill_id     VARCHAR(128)                              NOT NULL,
    paid_amount FLOAT UNSIGNED                            NOT NULL,
    paid_date   DATE                                      NOT NULL,
    paid_type   ENUM ('CHECK', 'CREDITCARD', 'INSURANCE') NOT NULL,
    FOREIGN KEY (bill_id) REFERENCES bill (bill_id)
);

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [22]:
%%sql

USE s23_midterm_medical;

SHOW TABLES;

 * mysql+pymysql://root:***@localhost
0 rows affected.
5 rows affected.

[('appointment',), ('bill',), ('patient',), ('payment',), ('physician',)]

## S2

_Question_

- Use the classic models database that you loaded.


- Write a query that returns the following results:

```(customerNumber, customerName, no_of_orders, total_revenue)```

- where:
    - ```customerNumber``` and ```customerName``` are from ```customers```.
    - ```no_of_orders``` is the number of orders the customer has placed.
    - ```total_revenue``` is the sum of ```quantityOrdered*priceEach``` for all ```orderDetails``` in ```orders``` associated with a customer.
    

- If a customer has not placed any orders, ```no_of_orders``` and ```total_revenue``` must be ```0```.

_Answer_

In [23]:
%%sql

USE classicmodels;

WITH order_price AS (SELECT orderNumber,
                            customerNumber,
                            SUM(quantityOrdered * priceEach) AS price
                     FROM orders
                              NATURAL JOIN orderdetails
                     GROUP BY orderNumber)
SELECT customers.customerNumber AS customerNumber,
       customerName,
       COUNT(orderNumber)       as no_of_orders,
       COALESCE(SUM(price), 0)  AS total_revenue
FROM customers
         LEFT OUTER JOIN order_price ON customers.customerNumber = order_price.customerNumber
GROUP BY customerNumber;

 * mysql+pymysql://root:***@localhost
0 rows affected.
122 rows affected.

[(103, 'Atelier graphique', 3, Decimal('22314.36')),
 (112, 'Signal Gift Stores', 3, Decimal('80180.98')),
 (114, 'Australian Collectors, Co.', 5, Decimal('180585.07')),
 (119, 'La Rochelle Gifts', 4, Decimal('158573.12')),
 (121, 'Baane Mini Imports', 4, Decimal('104224.79')),
 (124, 'Mini Gifts Distributors Ltd.', 17, Decimal('591827.34')),
 (125, 'Havel & Zbyszek Co', 0, Decimal('0.00')),
 (128, 'Blauer See Auto, Co.', 4, Decimal('75937.76')),
 (129, 'Mini Wheels Co.', 3, Decimal('66710.56')),
 (131, 'Land of Toys Inc.', 4, Decimal('149085.15')),
 (141, 'Euro+ Shopping Channel', 26, Decimal('820689.54')),
 (144, 'Volvo Model Replicas, Co', 4, Decimal('66694.82')),
 (145, 'Danish Wholesale Imports', 5, Decimal('129085.12')),
 (146, 'Saveley & Henriot, Co.', 3, Decimal('130305.35')),
 (148, 'Dragon Souveniers, Ltd.', 5, Decimal('156251.03')),
 (151, 'Muscle Machine Inc', 4, Decimal('177913.95')),
 (157, 'Diecast Classics Inc.', 4, Decimal('104358.69')),
 (161, 'Technics Stores Inc.', 4, Decimal('104545.22')),
 (166, 'Handji Gifts& Co', 4, Decimal('107746.75')),
 (167, 'Herkku Gifts', 3, Decimal('97562.47')),
 (168, 'American Souvenirs Inc', 0, Decimal('0.00')),
 (169, 'Porto Imports Co.', 0, Decimal('0.00')),
 (171, 'Daedalus Designs Imports', 2, Decimal('61781.70')),
 (172, "La Corne D'abondance, Co.", 3, Decimal('86553.52')),
 (173, 'Cambridge Collectables Co.', 2, Decimal('32198.69')),
 (175, 'Gift Depot Inc.', 3, Decimal('95424.63')),
 (177, 'Osaka Souveniers Co.', 2, Decimal('62361.22')),
 (181, 'Vitachrome Inc.', 3, Decimal('72497.64')),
 (186, 'Toys of Finland, Co.', 3, Decimal('95546.46')),
 (187, 'AV Stores, Co.', 3, Decimal('148410.09')),
 (189, 'Clover Collections, Co.', 2, Decimal('49898.27')),
 (198, 'Auto-Moto Classics Inc.', 3, Decimal('21554.26')),
 (201, 'UK Collectables, Ltd.', 3, Decimal('106610.72')),
 (202, 'Canadian Gift Exchange Network', 2, Decimal('70122.19')),
 (204, 'Online Mini Collectables', 2, Decimal('55577.26')),
 (205, 'Toys4GrownUps.com', 3, Decimal('93803.30')),
 (206, 'Asian Shopping Network, Co', 0, Decimal('0.00')),
 (209, 'Mini Caravy', 3, Decimal('75859.32')),
 (211, 'King Kong Collectables, Co.', 2, Decimal('45480.79')),
 (216, 'Enaco Distributors', 3, Decimal('68520.47')),
 (219, 'Boards & Toys Co.', 2, Decimal('7918.60')),
 (223, 'Natürlich Autos', 0, Decimal('0.00')),
 (227, 'Heintze Collectables', 2, Decimal('89909.80')),
 (233, 'Québec Home Shopping Network', 3, Decimal('68977.67')),
 (237, 'ANG Resellers', 0, Decimal('0.00')),
 (239, 'Collectable Mini Designs Co.', 2, Decimal('80375.24')),
 (240, 'giftsbymail.co.uk', 2, Decimal('71783.75')),
 (242, 'Alpha Cognac', 3, Decimal('60483.36')),
 (247, 'Messner Shopping Network', 0, Decimal('0.00')),
 (249, 'Amica Models & Co.', 2, Decimal('82223.23')),
 (250, 'Lyon Souveniers', 3, Decimal('67659.19')),
 (256, 'Auto Associés & Cie.', 2, Decimal('58876.41')),
 (259, 'Toms Spezialitäten, Ltd', 2, Decimal('89223.14')),
 (260, 'Royal Canadian Collectables, Ltd.', 2, Decimal('66812.00')),
 (273, 'Franken Gifts, Co', 0, Decimal('0.00')),
 (276, "Anna's Decorations, Ltd", 4, Decimal('137034.22')),
 (278, 'Rovelli Gifts', 3, Decimal('127529.69')),
 (282, 'Souveniers And Things Co.', 4, Decimal('133907.12')),
 (286, "Marta's Replicas Co.", 2, Decimal('90545.37')),
 (293, 'BG&E Collectables', 0, Decimal('0.00')),
 (298, 'Vida Sport, Ltd', 2, Decimal('108777.92')),
 (299, 'Norway Gifts By Mail, Co.', 2, Decimal('69059.04')),
 (303, 'Schuyler Imports', 0, Decimal('0.00')),
 (307, 'Der Hund Imports', 0, Decimal('0.00')),
 (311, 'Oulu Toy Supplies, Inc.', 3, Decimal('95706.15')),
 (314, 'Petit Auto', 3, Decimal('70851.58')),
 (319, 'Mini Classics', 2, Decimal('78432.16')),
 (320, 'Mini Creations Ltd.', 3, Decimal('101872.52')),
 (321, 'Corporate Gift Ideas Co.', 4, Decimal('132340.78')),
 (323, 'Down Under Souveniers, Inc', 5, Decimal('154622.08')),
 (324, 'Stylish Desk Decors, Co.', 3, Decimal('80556.73')),
 (328, 'Tekni Collectables Inc.', 3, Decimal('81806.55')),
 (333, 'Australian Gift Network, Co', 3, Decimal('55190.16')),
 (334, 'Suominen Souveniers', 3, Decimal('103896.74')),
 (335, 'Cramer Spezialitäten, Ltd', 0, Decimal('0.00')),
 (339, 'Classic Gift Ideas, Inc', 2, Decimal('57939.34')),
 (344, 'CAF Imports', 2, Decimal('46751.14')),
 (347, "Men 'R' US Retailers, Ltd.", 2, Decimal('41506.19')),
 (348, 'Asian Treasures, Inc.', 0, Decimal('0.00')),
 (350, 'Marseille Mini Autos', 3, Decimal('71547.53')),
 (353, 'Reims Collectables', 5, Decimal('126983.19')),
 (356, 'SAR Distributors, Co', 0, Decimal('0.00')),
 (357, 'GiftsForHim.com', 3, Decimal('94431.76')),
 (361, 'Kommission Auto', 0, Decimal('0.00')),
 (362, 'Gifts4AllAges.com', 3, Decimal('84340.32')),
 (363, 'Online Diecast Creations Co.', 3, Decimal('116449.29')),
 (369, 'Lisboa Souveniers, Inc', 0, Decimal('0.00')),
 (376, 'Precious Collectables', 0, Decimal('0.00')),
 (379, 'Collectables For Less Inc.', 3, Decimal('73533.65')),
 (381, 'Royale Belge', 4, Decimal('29217.18')),
 (382, 'Salzburg Collectables', 4, Decimal('137480.07')),
 (385, 'Cruz & Sons Co.', 3, Decimal('87468.30')),
 (386, "L'ordine Souveniers", 3, Decimal('125505.57')),
 (398, 'Tokyo Collectables, Ltd', 4, Decimal('105548.73')),
 (406, 'Auto Canal+ Petit', 3, Decimal('86436.97')),
 (409, 'Stuttgart Collectable Exchange', 0, Decimal('0.00')),
 (412, 'Extreme Desk Decorations, Ltd', 3, Decimal('90332.38')),
 (415, 'Bavarian Collectables Imports, Co.', 1, Decimal('31310.09')),
 (424, 'Classic Legends Inc.', 3, Decimal('69214.33')),
 (443, 'Feuer Online Stores, Inc', 0, Decimal('0.00')),
 (447, 'Gift Ideas Corp.', 3, Decimal('49967.78')),
 (448, 'Scandinavian Gift Ideas', 3, Decimal('120943.53')),
 (450, 'The Sharp Gifts Warehouse', 4, Decimal('143536.27')),
 (452, 'Mini Auto Werke', 3, Decimal('51059.99')),
 (455, 'Super Scale Inc.', 2, Decimal('70378.65')),
 (456, 'Microscale Inc.', 2, Decimal('29230.43')),
 (458, 'Corrida Auto Replicas, Ltd', 3, Decimal('112440.09')),
 (459, 'Warburg Exchange', 0, Decimal('0.00')),
 (462, 'FunGiftIdeas.com', 3, Decimal('88627.49')),
 (465, 'Anton Designs, Ltd.', 0, Decimal('0.00')),
 (471, 'Australian Collectables, Ltd', 3, Decimal('55866.02')),
 (473, 'Frau da Collezione', 2, Decimal('25358.32')),
 (475, 'West Coast Collectables Co.', 2, Decimal('43748.72')),
 (477, 'Mit Vergnügen & Co.', 0, Decimal('0.00')),
 (480, 'Kremlin Collectables, Co.', 0, Decimal('0.00')),
 (481, 'Raanan Stores, Inc', 0, Decimal('0.00')),
 (484, 'Iberia Gift Imports, Corp.', 2, Decimal('50987.85')),
 (486, 'Motor Mint Distributors Inc.', 3, Decimal('77726.59')),
 (487, 'Signal Collectibles Ltd.', 2, Decimal('42570.37')),
 (489, 'Double Decker Gift Stores, Ltd', 2, Decimal('29586.15')),
 (495, 'Diecast Collectables', 2, Decimal('65541.74')),
 (496, "Kelly's Gift Shop", 4, Decimal('137460.79'))]

## Best Baseball Players

_Question_

- This question uses ```lahmansdb_midterm.batting```, ```lahmansdb_midterm.pitching``` and ```lahmansdb_midterm.people```. You previously loaded this information.


- There query computes performance metrics:
    - Batting:
        - On-base percentage: OBP is (sum(h) + sum(BB))/(sum(ab) + sum(BB)). This value is ```NULL``` if ```sum(ab) = 0```.
        - Slugging percentage: SLG is defined by the function below. The value is ```NULL``` if ```sum(ab) = 0```.        
    ```
    (
        (sum(h) - sum(`1b`) - sum(`2b`) - sum(`3b`) - sum(hr)) +
        2*sum(`2b`) + 3*sum(`3b`) + 4*hr
    )/sum(ab)
   ```

    - Pitching:
        - total_wins is ```sum(w)```.
        - total_loses is ```sum(l)```.
        - win_percentage is ```sum(w)/(sum(w) + sum(l))```. This value is NULL if ```sum(w) + sum(l) = 0```.

- Professor Ferguson has two criteria for someone being a great baseball player. A play must meet at least one of the criteria to be a great baseball player.
    - Batting:
        - Total number of ```ab >= 1500```.
        - SLG: Career ```SLG >= .375```
    - Pitching:
        - ```(sum(w) + sum(l)) >= 200```.
        - ```win_percentage >= 0.70)``` or ```sum(w) >= 300.```
        
        
- In your result table there is some additional guidance.
    - ```great_because``` is either ```Pitcher``` or ```Batter``` based on whether the player matched the batting or pitching criteria.
    - The values from ```batting``` are ```None``` if the player did not qualify based on batting.
    - The values from ```pitching``` are ```None``` if the player did not qualify on pitching.

__Note:__ For this query to run efficiently, you will need to create indexes on the tables.

_Answer_

- Execute your create index statements below.

In [24]:
%%sql

USE lahmansdb_midterm;

CREATE INDEX batting_idx ON batting(ab, h, BB, `2b`, `3b`, hr);

CREATE INDEX pitching_idx ON pitching(w, l);

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.

[]

- Execute your SQL statement producing the query result below.

In [25]:
%%sql

USE lahmansdb_midterm;

WITH batting_criteria AS (SELECT playerID,
                                 IF(SUM(ab) = 0,
                                    NULL,
                                    SUM(h) + SUM(BB)) / (SUM(ab) + SUM(BB))
                                         AS OBP,
                                 IF(SUM(ab) = 0,
                                    NULL,
                                    ((SUM(h) - SUM(`2b`) - SUM(`3b`) - SUM(hr)) +
                                     2 * SUM(`2b`) + 3 * SUM(`3b`) + 4 * SUM(hr)) / SUM(ab))
                                         AS SLG,
                                 SUM(ab) AS ab_sum
                          FROM people
                                   NATURAL JOIN batting
                          GROUP BY playerID),
     batting_filtered AS (SELECT playerID,
                                 IF(ab_sum >= 1500 AND SLG >= .375, OBP, 'None') AS OBP,
                                 IF(ab_sum >= 1500 AND SLG >= .375, SLG, 'None') AS SLG,
                                 ab_sum >= 1500 AND SLG >= .375                  AS is_great
                          FROM batting_criteria),
     pitching_criteria AS (SELECT playerID,
                                  SUM(w)                                                    AS total_wins,
                                  SUM(l)                                                    AS total_loses,
                                  IF(SUM(w) + SUM(l) = 0, NULL, SUM(w) / (SUM(w) + SUM(l))) AS win_percentage
                           FROM people
                                    NATURAL JOIN pitching
                           GROUP BY playerID),
     pitching_filtered AS (SELECT playerID,
                                  IF((total_loses + total_wins >= 300 AND (win_percentage >= .70 OR total_wins >= 300)),
                                     total_wins,
                                     'None')                                                                       AS total_wins,
                                  IF((total_loses + total_wins >= 300 AND (win_percentage >= .70 OR total_wins >= 300)),
                                     total_loses,
                                     'None')                                                                       AS total_loses,
                                  IF((total_loses + total_wins >= 300 AND (win_percentage >= .70 OR total_wins >= 300)),
                                     win_percentage,
                                     'None')                                                                       AS win_percentage,
                                  total_loses + total_wins >= 300 AND
                                  (win_percentage >= .70 OR total_wins >= 300)                                     AS is_great
                           FROM pitching_criteria)
SELECT playerID, OBP, SLG, total_wins, total_loses,
       IF(pitching_filtered.is_great, 'Pitcher', 'Batter') AS great_because
FROM pitching_filtered JOIN batting_filtered USING (playerID)
WHERE pitching_filtered.is_great OR batting_filtered.is_great;

/* NOTE: I limited the output size when running. */

 * mysql+pymysql://root:***@localhost
0 rows affected.
20 rows affected.

[('ansonca01', '0.3923', '0.4466', 'None', 'None', 'Batter'),
 ('barnero01', '0.3893', '0.4676', 'None', 'None', 'Batter'),
 ('broutda01', '0.4154', '0.5201', 'None', 'None', 'Batter'),
 ('dunlafr01', '0.3387', '0.4056', 'None', 'None', 'Batter'),
 ('ewingbu01', '0.3505', '0.4557', 'None', 'None', 'Batter'),
 ('dennyje01', '0.2850', '0.3837', 'None', 'None', 'Batter'),
 ('brownpe01', '0.3995', '0.4666', 'None', 'None', 'Batter'),
 ('clarkjo01', 'None', 'None', '328', '178', 'Pitcher'),
 ('burnsoy01', '0.3633', '0.4454', 'None', 'None', 'Batter'),
 ('carutbo01', '0.3858', '0.4000', 'None', 'None', 'Batter'),
 ('becklja01', '0.3496', '0.4356', 'None', 'None', 'Batter'),
 ('burkeje01', '0.4103', '0.4461', 'None', 'None', 'Batter'),
 ('davisge01', '0.3568', '0.4050', 'None', 'None', 'Batter'),
 ('abbeych01', '0.3432', '0.4038', 'None', 'None', 'Batter'),
 ('bresnro01', '0.3784', '0.3771', 'None', 'None', 'Batter'),
 ('donlimi01', '0.3826', '0.4683', 'None', 'None', 'Batter'),
 ('chaseha01', '0.3164', '0.3909', 'None', 'None', 'Batter'),
 ('cobbty01', '0.4287', '0.5119', 'None', 'None', 'Batter'),
 ('alexape01', 'None', 'None', '373', '208', 'Pitcher'),
 ('bressru01', '0.3739', '0.4133', 'None', 'None', 'Batter')]

# Data and Schema Cleanup

## Explanation and Setup

- There are several issues with the schema for ```clasicmodels.``` Two of the issues are:
    - ```customers.country:``` Having programs or people enter country names is prone to errors.
    - ```products.productCode``` is clearly not an atomic value.
    
    
- The following SQL creates a schema with copies of the data. The SQL also loads a table of [ISO country codes.](https://en.wikipedia.org/wiki/List_of_ISO_3166_country_codes)

In [26]:
%sql create schema classicmodels_midterm;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [27]:
iso_df = pandas.read_csv('./wikipedia-iso-country-codes.csv')
iso_df.to_sql('country_codes', schema='classicmodels_midterm',
              con=sql_engine, index=False, if_exists="replace")

246

In [28]:
%%sql

use classicmodels_midterm;

alter table classicmodels_midterm.country_codes
    change `English short name lower case` short_name text null;

alter table classicmodels_midterm.country_codes
    change `Alpha-2 code` alpha_2_code text null;

alter table classicmodels_midterm.country_codes
    change `Alpha-3 code` alpha_3_code text null;

alter table classicmodels_midterm.country_codes
    change `Numeric code` numberic_code bigint null;

alter table classicmodels_midterm.country_codes
    change `ISO 3166-2` iso_text text null;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [29]:
%%sql

use classicmodels_midterm;


create table customers as select * from classicmodels.customers;


create table products as select * from classicmodels.products;

 * mysql+pymysql://root:***@localhost
0 rows affected.
122 rows affected.
110 rows affected.

[]

## DE-1

_Question_


- There are four ```country``` values in ```customers``` that are not in ```short_names``` of ```country_codes.```


- The four missing values are:

| country |
| :---: |
| USA |
| Norway |  
| UK |
| Russia |


- Write an SQL query that returns the information about by querying ```customers``` and ```country_codes```

_Answer_

In [30]:
%%sql

SELECT DISTINCT country FROM customers
WHERE country NOT IN
(SELECT short_name AS country FROM country_codes);

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('USA',), ('Norway  ',), ('UK',), ('Russia',)]

## DE-2

_Question_

- Norway is on the list because there are spaces in the entry. The following query shows this fact.

In [31]:
%%sql

select customerNumber, customerName, country
from customers where length(country) != length(trim(country));

 * mysql+pymysql://root:***@localhost
2 rows affected.

[(167, 'Herkku Gifts', 'Norway  '),
 (299, 'Norway Gifts By Mail, Co.', 'Norway  ')]

- The mapping of the other country names is:

| customers.country | country_codes.short_name |
| :---: | :---: |
| USA | United States |
| UK | United Kingdom |
| Russia | Russian Federation |

- Write a __single__ ```update``` statement that corrects the values for ```customers.country```.

_Answer_

In [32]:
%%sql

UPDATE customers
SET country =
        CASE
            WHEN country = 'USA' THEN 'United States'
            WHEN country = 'UK' THEN 'United Kingdom'
            WHEN country = 'Russia' THEN 'Russian Federation'
            WHEN LENGTH(country) != LENGTH(TRIM(country)) THEN TRIM(country)
            ELSE country
        END;

 * mysql+pymysql://root:***@localhost
122 rows affected.

[]

## DE-3

_Question_

- The final tasks are:
    - Add a column ```iso_code``` to ```customers``` that is the ```alpha_2_code``` from ```country_codes```.
    - Create a foreign key relationship ```customers.iso_code -> country_codes.alpha_2_code```.
    - Drop ```country``` from ```customers```.
    - Create a view ```customers_country``` of the form ```(customerNumber, customerName, country, iso_code)```.

_Answer_

In [33]:
%%sql

ALTER TABLE customers
    ADD iso_code VARCHAR(5);

ALTER TABLE country_codes MODIFY alpha_2_code VARCHAR(5);

CREATE INDEX country_idx ON country_codes (alpha_2_code);

UPDATE customers
SET iso_code = (SELECT alpha_2_code
                FROM country_codes
                WHERE short_name = customers.country);

ALTER TABLE customers
ADD CONSTRAINT FOREIGN KEY (iso_code) REFERENCES country_codes(alpha_2_code);

ALTER TABLE customers
    DROP country;

CREATE VIEW customers_country AS
SELECT customerNumber,
       customerName,
       country_codes.short_name AS country,
       iso_code
FROM customers
         LEFT OUTER JOIN country_codes ON customers.iso_code = country_codes.alpha_2_code;

 * mysql+pymysql://root:***@localhost
0 rows affected.
246 rows affected.
0 rows affected.
122 rows affected.
122 rows affected.
0 rows affected.
0 rows affected.

[]

In [34]:
%%sql

SELECT *
FROM customers_country
ORDER BY customerName
LIMIT 25;

 * mysql+pymysql://root:***@localhost
25 rows affected.

[(242, 'Alpha Cognac', 'France', 'FR'),
 (168, 'American Souvenirs Inc', 'United States', 'US'),
 (249, 'Amica Models & Co.', 'Italy', 'IT'),
 (237, 'ANG Resellers', 'Spain', 'ES'),
 (276, "Anna's Decorations, Ltd", 'Australia', 'AU'),
 (465, 'Anton Designs, Ltd.', 'Spain', 'ES'),
 (206, 'Asian Shopping Network, Co', 'Singapore', 'SG'),
 (348, 'Asian Treasures, Inc.', 'Ireland', 'IE'),
 (103, 'Atelier graphique', 'France', 'FR'),
 (471, 'Australian Collectables, Ltd', 'Australia', 'AU'),
 (114, 'Australian Collectors, Co.', 'Australia', 'AU'),
 (333, 'Australian Gift Network, Co', 'Australia', 'AU'),
 (256, 'Auto Associés & Cie.', 'France', 'FR'),
 (406, 'Auto Canal+ Petit', 'France', 'FR'),
 (198, 'Auto-Moto Classics Inc.', 'United States', 'US'),
 (187, 'AV Stores, Co.', 'United Kingdom', 'GB'),
 (121, 'Baane Mini Imports', 'Norway', 'NO'),
 (415, 'Bavarian Collectables Imports, Co.', 'Germany', 'DE'),
 (293, 'BG&E Collectables', 'Switzerland', 'CH'),
 (128, 'Blauer See Auto, Co.', 'Germany', 'DE'),
 (219, 'Boards & Toys Co.', 'United States', 'US'),
 (344, 'CAF Imports', 'Spain', 'ES'),
 (173, 'Cambridge Collectables Co.', 'United States', 'US'),
 (202, 'Canadian Gift Exchange Network', 'Canada', 'CA'),
 (339, 'Classic Gift Ideas, Inc', 'United States', 'US')]

## DE-4

- Just kidding.


- My first intent was to have you fix ```products```.


- Then, I thought I would make this an extra credit question.


- Finally, I decided that all students get 5 points added to there score for this exam. Since I never "curve up," you all get a bonus on final grade for putting up with the class.